# *Pandas*

In [1]:
t = (1,2,3,4)

t[1:3]

(2, 3)

In [1]:
#importing the Pandas library.

import pandas as pd

dictionary = {"name":["susan","mohamed","samer","sagal","betul","fatma"],
             "age":[12,34,56,78,None,12],
             "note":[123,456,78,87654,None,89]}

dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

      name   age     note
0    susan  12.0    123.0
1  mohamed  34.0    456.0
2    samer  56.0     78.0
3    sagal  78.0  87654.0
4    betul   NaN      NaN
5    fatma  12.0     89.0

In [2]:
head = dataframe1.head() 
print(head)

      name   age     note
0    susan  12.0    123.0
1  mohamed  34.0    456.0
2    samer  56.0     78.0
3    sagal  78.0  87654.0
4    betul   NaN      NaN

In [3]:
tail = dataframe1.tail()
print(tail)

      name   age     note
1  mohamed  34.0    456.0
2    samer  56.0     78.0
3    sagal  78.0  87654.0
4    betul   NaN      NaN
5    fatma  12.0     89.0

# *Pandas Basic Method*

In [4]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [5]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   note    5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 276.0+ bytes
None

In [6]:
print(dataframe1.dtypes)

name     object
age     float64
note    float64
dtype: object

In [7]:
print(dataframe1.describe())

             age         note
count   5.000000      5.00000
mean   38.400000  17680.00000
std    28.684491  39116.96814
min    12.000000     78.00000
25%    12.000000     89.00000
50%    34.000000    123.00000
75%    56.000000    456.00000
max    78.000000  87654.00000

# *Indexing & Slicing*

In [8]:
print(dataframe1["name"]) 
print(dataframe1.loc[:, "age"])                      
dataframe1["yeni_future"] = [1,2,3,4,5,6]
print(dataframe1.loc[:3,"age"]) 
print(dataframe1.loc[:3, "name":"note"])                 
print(dataframe1.loc[::-1])

0      susan
1    mohamed
2      samer
3      sagal
4      betul
5      fatma
Name: name, dtype: object
0    12.0
1    34.0
2    56.0
3    78.0
4     NaN
5    12.0
Name: age, dtype: float64
0    12.0
1    34.0
2    56.0
3    78.0
Name: age, dtype: float64
      name   age     note
0    susan  12.0    123.0
1  mohamed  34.0    456.0
2    samer  56.0     78.0
3    sagal  78.0  87654.0
      name   age     note  yeni_future
5    fatma  12.0     89.0            6
4    betul   NaN      NaN            5
3    sagal  78.0  87654.0            4
2    samer  56.0     78.0            3
1  mohamed  34.0    456.0            2
0    susan  12.0    123.0            1

In [9]:
print(dataframe1.yeni_future)

0    1
1    2
2    3
3    4
4    5
5    6
Name: yeni_future, dtype: int64

In [10]:
print(dataframe1.loc[:, "age"])

0    12.0
1    34.0
2    56.0
3    78.0
4     NaN
5    12.0
Name: age, dtype: float64

In [12]:
print(dataframe1.loc[:3,"age"])

0    12.0
1    34.0
2    56.0
3    78.0
Name: age, dtype: float64

In [13]:
print(dataframe1.loc[:3, "name":"note"])

      name   age     note
0    susan  12.0    123.0
1  mohamed  34.0    456.0
2    samer  56.0     78.0
3    sagal  78.0  87654.0

In [14]:
print(dataframe1.loc[:3, ["name","note"]])

      name     note
0    susan    123.0
1  mohamed    456.0
2    samer     78.0
3    sagal  87654.0

In [15]:
print(dataframe1.loc[::-1])

      name   age     note  yeni_future
5    fatma  12.0     89.0            6
4    betul   NaN      NaN            5
3    sagal  78.0  87654.0            4
2    samer  56.0     78.0            3
1  mohamed  34.0    456.0            2
0    susan  12.0    123.0            1

In [16]:
print(dataframe1.loc[:,:"age"])

      name   age
0    susan  12.0
1  mohamed  34.0
2    samer  56.0
3    sagal  78.0
4    betul   NaN
5    fatma  12.0

In [17]:
print(dataframe1.iloc[:,[2]])

      note
0    123.0
1    456.0
2     78.0
3  87654.0
4      NaN
5     89.0

# *Filtering Pandas Data Frame*

In [18]:
filtre1 = dataframe1.age>10                          
dataframe1["bool"]= filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  12.0   True
1  34.0   True
2  56.0   True
3  78.0   True
4   NaN  False
5  12.0   True

In [19]:
type(filtre1)

pandas.core.series.Series

In [20]:
filtrelenmis_data= dataframe1[filtre1] 
print(filtrelenmis_data)

      name   age     note  yeni_future  bool
0    susan  12.0    123.0            1  True
1  mohamed  34.0    456.0            2  True
2    samer  56.0     78.0            3  True
3    sagal  78.0  87654.0            4  True
5    fatma  12.0     89.0            6  True

In [21]:
filtre2 = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtre2&filtre1] 
print(filtrelenmis_data2)

      name   age     note  yeni_future  bool
0    susan  12.0    123.0            1  True
1  mohamed  34.0    456.0            2  True
3    sagal  78.0  87654.0            4  True

# *List Comprehension*

In [22]:
import numpy as np
ortalama = dataframe1.note.mean()  
print(ortalama)
ortlama_np= np.mean(dataframe1.note) 
print(ortlama_np)

17680.0
17680.0

In [23]:
dataframe1.dropna(inplace=True) 
dataframe1

      name   age     note  yeni_future  bool
0    susan  12.0    123.0            1  True
1  mohamed  34.0    456.0            2  True
2    samer  56.0     78.0            3  True
3    sagal  78.0  87654.0            4  True
5    fatma  12.0     89.0            6  True

In [24]:
print(dataframe1.note.mean()) 

dataframe1["ortalama"]= ["ortalamanın altında" if dataframe1.note.mean()>each else "ortalamanın üstünde" for each in dataframe1.note]
dataframe1

17680.0

      name   age     note  yeni_future  bool             ortalama
0    susan  12.0    123.0            1  True  ortalamanın altında
1  mohamed  34.0    456.0            2  True  ortalamanın altında
2    samer  56.0     78.0            3  True  ortalamanın altında
3    sagal  78.0  87654.0            4  True  ortalamanın üstünde
5    fatma  12.0     89.0            6  True  ortalamanın altında

In [25]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENI_FUTURE', 'BOOL', 'ORTALAMA'], dtype='object')

In [26]:
dataframe1["yeni2_future"]=[1,1,1,1,1]
dataframe1.columns = [each.split('_')[0]+" "+each.split('_')[1] if len(each.split('_'))>1 else each for each in dataframe1.columns]
dataframe1

,NAME,AGE,NOTE,YENI FUTURE,BOOL,ORTALAMA,yeni2 future
0,susan,12.0,123.0,1,True,ortalamanın altında,1
1,mohamed,34.0,456.0,2,True,ortalamanın altında,1
2,samer,56.0,78.0,3,True,ortalamanın altında,1
3,sagal,78.0,87654.0,4,True,ortalamanın üstünde,1
5,fatma,12.0,89.0,6,True,ortalamanın altında,1

In [27]:
dataframe1.columns = [ each.split(" ")[0]+"_"+each.split(" ")[1] if len(each.split(" "))>1 else each for each in dataframe1.columns]
dataframe1

,NAME,AGE,NOTE,YENI_FUTURE,BOOL,ORTALAMA,yeni2_future
0,susan,12.0,123.0,1,True,ortalamanın altında,1
1,mohamed,34.0,456.0,2,True,ortalamanın altında,1
2,samer,56.0,78.0,3,True,ortalamanın altında,1
3,sagal,78.0,87654.0,4,True,ortalamanın üstünde,1
5,fatma,12.0,89.0,6,True,ortalamanın altında,1

# *Concatenating Data*

In [28]:
dataframe1.drop(["yeni2_future","YENI_FUTURE"],axis=1,inplace=True)
dataframe1

      NAME   AGE     NOTE  BOOL             ORTALAMA
0    susan  12.0    123.0  True  ortalamanın altında
1  mohamed  34.0    456.0  True  ortalamanın altında
2    samer  56.0     78.0  True  ortalamanın altında
3    sagal  78.0  87654.0  True  ortalamanın üstünde
5    fatma  12.0     89.0  True  ortalamanın altında

In [29]:
data1 = dataframe1.head()     
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

      NAME   AGE     NOTE  BOOL             ORTALAMA
0    susan  12.0    123.0  True  ortalamanın altında
1  mohamed  34.0    456.0  True  ortalamanın altında
2    samer  56.0     78.0  True  ortalamanın altında
3    sagal  78.0  87654.0  True  ortalamanın üstünde
5    fatma  12.0     89.0  True  ortalamanın altında
0    susan  12.0    123.0  True  ortalamanın altında
1  mohamed  34.0    456.0  True  ortalamanın altında
2    samer  56.0     78.0  True  ortalamanın altında
3    sagal  78.0  87654.0  True  ortalamanın üstünde
5    fatma  12.0     89.0  True  ortalamanın altında

In [30]:
data_contact2 = pd.concat([data1,data2],axis=1) 
data_contact2

,NAME,AGE,NOTE,BOOL,ORTALAMA,NAME,AGE,NOTE,BOOL,ORTALAMA
0,susan,12.0,123.0,True,ortalamanın altında,susan,12.0,123.0,True,ortalamanın altında
1,mohamed,34.0,456.0,True,ortalamanın altında,mohamed,34.0,456.0,True,ortalamanın altında
2,samer,56.0,78.0,True,ortalamanın altında,samer,56.0,78.0,True,ortalamanın altında
3,sagal,78.0,87654.0,True,ortalamanın üstünde,sagal,78.0,87654.0,True,ortalamanın üstünde
5,fatma,12.0,89.0,True,ortalamanın altında,fatma,12.0,89.0,True,ortalamanın altında

# *Transforming Data*

In [31]:
dataframe1["buyuk_yas"] = [each*2 for each in dataframe1.AGE]
dataframe1

      NAME   AGE     NOTE  BOOL             ORTALAMA  buyuk_yas
0    susan  12.0    123.0  True  ortalamanın altında       24.0
1  mohamed  34.0    456.0  True  ortalamanın altında       68.0
2    samer  56.0     78.0  True  ortalamanın altında      112.0
3    sagal  78.0  87654.0  True  ortalamanın üstünde      156.0
5    fatma  12.0     89.0  True  ortalamanın altında       24.0

In [32]:
def mlt(yas):
    return yas*2
dataframe1["apply_metodu"] = dataframe1.AGE.apply(mlt)
dataframe1

      NAME   AGE     NOTE  BOOL             ORTALAMA  buyuk_yas  apply_metodu
0    susan  12.0    123.0  True  ortalamanın altında       24.0          24.0
1  mohamed  34.0    456.0  True  ortalamanın altında       68.0          68.0
2    samer  56.0     78.0  True  ortalamanın altında      112.0         112.0
3    sagal  78.0  87654.0  True  ortalamanın üstünde      156.0         156.0
5    fatma  12.0     89.0  True  ortalamanın altında       24.0          24.0